;;;
;;; Соболев
;;; Задание 1
;;; Определите FUNCALL через функционал APPLY
;;;
(defun my_funcall (x &rest lst) 
  (apply x lst))
;;;
;;; (my_funcall #'+ 1 2 3 4 5)
;;; 15
;;; (my_funcall #'+ )
;;; 0
;;; (my_funcall #'list '(a b c d e) '(1 2 3 4 5))
;;; ((A B C D E) (1 2 3 4 5))
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 
;;; Соболев
;;; Задание 7
;;; Определите УДАЛИТЬ-ЕСЛИ-НЕ, удаляющий из списка все элементы,
;;; которые не обладают свойством.
;;;
(defun УДАЛИТЬ-ЕСЛИ-НЕ (pred lst)
  (mapcan #'(lambda (a) (if (funcall pred a) (list a) nil)) lst)) 
;;;
;;; (УДАЛИТЬ-ЕСЛИ-НЕ #'evenp '(1 2 3 4 5 6 7))
;;; (2 4 6)
;;; (УДАЛИТЬ-ЕСЛИ-НЕ #'oddp '(1 2 3 4 5 6 7))
;;; (1 3 5 7)
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 
;;; Соболев
;;; Задание 11
;;; Определите функционал МНОГОФУН 
;;; (МНОГОФУН '(f g ... h) x) <=> (LIST (f x) (g x) ... (h x)).
;;;
(defun МНОГОФУН (func x)
  (mapcar #'(lambda (v) (funcall v x)) func))
;;;
;;; (МНОГОФУН '(listp car cdr length) '(1 2 3 4 5 6 7))
;;; (T 1 (2 3 4 5 6 7) 7)
;;; (МНОГОФУН '(sin cos) 0)
;;; (0.0 1.0)
;;;
